Repository: NikulovE/sftp-explorer
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: es_mx, id_id, pt_pt, ru_ru, zh_cn, zh_tw

# PrivateKeyPathBox.Header
source: Private key file
es_mx: archivo de clave privada
id_id: File kunci pribadi
pt_pt: Ficheiro de chave privada
ru_ru: Файл приватного ключа
zh_cn: 私钥文件
zh_tw: 私鑰文件

# PrivateKeyPathBox.PlaceholderText
source: Select or enter the path to a private key
es_mx: Seleccione o ingrese la ruta a una clave privada
id_id: Pilih atau masukkan jalur ke kunci pribadi
pt_pt: Selecione ou introduza o caminho para uma chave privada
ru_ru: Выберите или введите путь к приватному ключу
zh_cn: 选择或输入私钥的路径
zh_tw: 選擇或輸入私鑰的路徑

# BrowsePrivateKeyButton.Content
source: Browse...
es_mx: Navegar...
id_id: Jelajahi...
pt_pt: Navegar...
ru_ru: Обзор...
zh_cn: 浏览...
zh_tw: 瀏覽...

# PrivateKeyPassphraseBox.Header
source: Key passphrase (optional)
es_mx: Frase de contraseña de la clave (opcional)
id_id: Frasa sandi kunci (opsional)
pt_pt: Frase secreta da chave (opcional)
ru_ru: Ключевая фраза (необязательно)
zh_cn: 密钥口令（可选）
zh_tw: 金鑰複雜密碼（選用）

# PrivateKeyPassphraseBox.PlaceholderText
source: Leave empty for an unencrypted key
es_mx: Déjelo vacío para una clave no cifrada
id_id: Biarkan kosong untuk kunci yang tidak terenkripsi
pt_pt: Deixe em branco para uma chave não encriptada
ru_ru: Оставьте пустым для незашифрованного ключа
zh_cn: 未加密的密钥请留空
zh_tw: 未加密的金鑰請留空

# EditPassphraseLabel
source: Key passphrase (leave empty to keep current)
es_mx: Frase de contraseña de la clave (déjela vacía para conservar la actual)
id_id: Frasa sandi kunci (biarkan kosong untuk mempertahankan yang saat ini digunakan)
pt_pt: Frase secreta da chave (deixe em branco para manter a atual)
ru_ru: Ключевая фраза (пусто — оставить текущую)
zh_cn: 密钥口令（留空以保留当前值）
zh_tw: 金鑰複雜密碼（留空以保留目前值）

# EditPassphrasePlaceholder
source: Enter a new passphrase only to replace the saved one
es_mx: Escriba una nueva frase de contraseña solo para sustituir la guardada
id_id: Masukkan frasa sandi baru hanya untuk menggantikan yang tersimpan
pt_pt: Introduza uma nova frase secreta apenas para substituir a guardada
ru_ru: Введите новую фразу только для замены сохранённой
zh_cn: 仅在需要替换已保存的口令时输入新口令
zh_tw: 僅在要取代已儲存的複雜密碼時輸入新的複雜密碼

# PrivateKeyRequired
source: Select a private key file
es_mx: Seleccione un archivo de clave privada
id_id: Pilih file kunci pribadi
pt_pt: Selecione um ficheiro de chave privada
ru_ru: Выберите файл приватного ключа
zh_cn: 选择私钥文件
zh_tw: 選擇私鑰文件

# PrivateKeyNotFound
source: The private key file was not found
es_mx: No se encontró el archivo de clave privada
id_id: File kunci pribadi tidak ditemukan
pt_pt: O ficheiro de chave privada não foi encontrado
ru_ru: Файл приватного ключа не найден
zh_cn: 未找到私钥文件
zh_tw: 未找到私鑰文件

# PrivateKeyPickerTitle
source: Select a private key
es_mx: Seleccione una clave privada
id_id: Pilih kunci pribadi
pt_pt: Selecione uma chave privada
ru_ru: Выбор приватного ключа
zh_cn: 选择私钥
zh_tw: 選擇私鑰

# ConnectToProfileTitle
source: Connect to {0}
es_mx: Conéctate a {0}
id_id: Hubungkan ke {0}
pt_pt: Ligue-se a {0}
ru_ru: Подключение к {0}
zh_cn: 连接到{0}
zh_tw: 連接到{0}

# PassphrasePromptHelp
source: Enter the key passphrase, or leave it empty if the key is not encrypted.
es_mx: Escriba la frase de contraseña de la clave o déjela vacía si la clave no está cifrada.
id_id: Masukkan frasa sandi kunci, atau biarkan kosong jika kunci tidak dienkripsi.
pt_pt: Introduza a frase secreta da chave ou deixe-a em branco se a chave não estiver cifrada.
ru_ru: Введите ключевую фразу или оставьте поле пустым, если ключ не зашифрован.
zh_cn: 请输入密钥口令；如果密钥未加密，请留空。
zh_tw: 請輸入金鑰複雜密碼；若金鑰未加密，請留空。

# PrivateKeyPassphraseLabel
source: Key passphrase
es_mx: Frase de contraseña de la clave
id_id: Frasa sandi kunci
pt_pt: Frase secreta da chave
ru_ru: Ключевая фраза
zh_cn: 密钥口令
zh_tw: 金鑰複雜密碼

# NewConnectionButton.AutomationProperties.Name
source: New Connection
es_mx: Nueva conexión
id_id: Koneksi Baru
pt_pt: Nova ligação
ru_ru: Новое подключение
zh_cn: 新连接
zh_tw: 新連接

# ConnectionProfileSaveFailedTitle
source: Connection not saved
es_mx: Conexión no guardada
id_id: Koneksi tidak disimpan
pt_pt: Ligação não salva
ru_ru: Подключение не сохранено
zh_cn: 连接未保存
zh_tw: 連線未儲存

# ConnectionProfileSaveFailedMessage
source: The connection is active, but its profile or password could not be saved. Check access to AppData and Windows Credential Manager.
es_mx: La conexión está activa, pero no se pudo guardar su perfil o contraseña. Verifique el acceso a AppData y Windows Credential Manager.
id_id: Sambungan aktif, namun profil atau kata sandinya tidak dapat disimpan. Periksa akses ke AppData dan Windows Credential Manager.
pt_pt: A ligação está ativa, mas não foi possível guardar o seu perfil ou palavra-passe. Verifique o acesso ao AppData e ao Windows Credential Manager.
ru_ru: Подключение активно, но его профиль или пароль сохранить не удалось. Проверьте доступ к AppData и диспетчеру учётных данных Windows.
zh_cn: 连接处于活动状态，但无法保存其配置文件或密码。检查对 AppData 和 Windows 凭据管理器的访问。
zh_tw: 連線處於活動狀態，但無法儲存其設定檔或密碼。檢查對 AppData 和 Windows 憑證管理員的存取。

# ConnectionProfileDeleteFailedTitle
source: Connection not deleted
es_mx: Conexión no eliminada
id_id: Koneksi tidak dihapus
pt_pt: Ligação não excluída
ru_ru: Подключение не удалено
zh_cn: 连接未删除
zh_tw: 連接未刪除

# ConnectionProfileDeleteFailedMessage
source: The connection was kept because its profile could not be saved safely. Check access to AppData and try again.
es_mx: La conexión se mantuvo porque su perfil no se pudo guardar de forma segura. Verifique el acceso a AppData e inténtelo nuevamente.
id_id: Sambungan dipertahankan karena profilnya tidak dapat disimpan dengan aman. Periksa akses ke AppData dan coba lagi.
pt_pt: A ligação foi mantida porque não foi possível guardar o seu perfil em segurança. Verifique o acesso ao AppData e tente novamente.
ru_ru: Подключение сохранено, потому что безопасно записать изменения профиля не удалось. Проверьте доступ к AppData и повторите попытку.
zh_cn: 由于无法安全保存其配置文件，因此保留了连接。检查对 AppData 的访问并重试。
zh_tw: 由於無法安全地保存其配置文件，因此保留了連接。檢查對 AppData 的存取並重試。

# UploadCompletedWithErrors
source: {0} of {1} items uploaded. Failed: {2}
es_mx: {0} de {1} elementos subidos. Error: {2}
id_id: {0} dari {1} item diunggah. Gagal: {2}
pt_pt: {0} de {1} artigos enviados. Falha: {2}
ru_ru: Загружено {0} из {1} элементов. Ошибки: {2}
zh_cn: 已上传 {0} 项，共 {1} 项。失败：{2}
zh_tw: 已上傳 {0} 項，共 {1} 項。失敗：{2}

# DeleteCompletedWithErrors
source: Delete completed with {0} failed item(s).
es_mx: Eliminación completada con {0} elementos fallidos.
id_id: Penghapusan selesai dengan {0} item yang gagal.
pt_pt: Eliminação concluída; não foi possível eliminar {0} item(ns).
ru_ru: Удаление завершено, не удалось удалить элементов: {0}.
zh_cn: 删除已完成，有 {0} 个失败项目。
zh_tw: 刪除已完成，有 {0} 個失敗項目。
